app/Http/Controllers/ArticleController.php

    public function index(Request $request)
    {
        $status     = $request->get('status');
        $keyword    = $request->get('keyword') ? $request->get('keyword') : '';
        $category   = $request->get('c') ? $request->get('c') : '';

        if ($status) {
            // $articles = \App\Article::where('status', strtoupper($status))->where('title', 'LIKE', "%$keyword%")->paginate(10);
            $articles = Article::with('categories')
                ->whereHas('categories', function ($q) use ($category) {
                    $q->where('name', 'LIKE', "%$category%");
                })
                ->where('status', strtoupper($status))
                ->where('title', 'LIKE', "%$keyword%")
                ->orderBy('created_at', 'desc')
                ->paginate(10);
        } else {
            // $articles = \App\Article::with('categories')->where('title', 'LIKE', "%$keyword%")->paginate(10);
            $articles = Article::with('categories')
                ->whereHas('categories', function ($q) use ($category) {
                    $q->where('name', 'LIKE', "%$category%");
                })
                ->where('title', 'LIKE', "%$keyword%")
                ->orderBy('created_at', 'desc')
                ->paginate(10);
---
select * from `articles` where exists (select * from `categories` inner join `article_category` on `categories`.`id` = `article_category`.`category_id` where `articles`.`id` = `article_category`.`article_id` and `name` LIKE '%%') and `title` LIKE '%%' order by `created_at` desc limit 10 offset 0
select `categories`.*, `article_category`.`article_id` as `pivot_article_id`, `article_category`.`category_id` as `pivot_category_id` from `categories` inner join `article_category` on `categories`.`id` = `article_category`.`category_id` where `article_category`.`article_id` in (1)
select count(*) as aggregate from `articles` where exists (select * from `categories` inner join `article_category` on `categories`.`id` = `article_category`.`category_id` where `articles`.`id` = `article_category`.`article_id` and `name` LIKE '%%') and `title` LIKE '%%'

    public function store(Request $request)
    {
        Validator::make($request->all(), [
            'title'      => 'required|min:2|max:200'
        ])->validate();

        $new_articles               = new Article;
        $new_articles->title        = $request->get('title');
        $new_articles->slug         = Str::slug($request->get('title'), '-');
        $new_articles->content      = $request->get('content');
        $new_articles->create_by    = Auth::user()->id;
        $new_articles->status       = $request->get('save_action');
        $new_articles->save();
---
insert into `articles` (`title`, `slug`, `content`, `create_by`, `status`, `updated_at`, `created_at`) values ('Tata cara', 'tata-cara', '<p>Tata cara</p>', 3, 'PUBLISH', '2024-02-26 01:41:00', '2024-02-26 01:41:00')

    public function edit($id)
    {
        $article = Article::findOrFail($id);
---
select * from `articles` where `articles`.`id` = '1' limit 1

    public function update(Request $request, $id)
    {
        $article = Article::findOrFail($id);

        $article->title        = $request->get('title');
        $article->slug         = Str::slug($request->get('title'), '-');
        $article->content      = $request->get('content');
        $article->status       = $request->get('save_action');
        $article->update_by    = Auth::user()->id;
---
select * from `articles` where `articles`.`id` = '1' limit 1
update `articles` set `title` = 'Asadasdad', `slug` = 'asadasdad', `status` = 'DRAFT', `update_by` = 3, `articles`.`updated_at` = '2024-02-26 01:32:20' where `id` = 1

    public function destroy($id)
    {
        $article = Article::findOrFail($id);
        $article->forceDelete();
---
select * from `articles` where `articles`.`id` = '1' limit 1
delete from `articles` where `id` = 1