app/Http/Controllers/CategoryController.php

select * from `categories`
---
    public function index()
    {
        $categories = Category::all();

insert into `categories` (`name`, `description`, `create_by`, `slug`, `image`, `updated_at`, `created_at`) values ('LARAVEL', 'Laravel', 3, 'laravel', '1708417715_APM.png', '2024-02-20 08:28:35', '2024-02-20 08:28:35')
---
    public function store(Request $request)
    {
        \Validator::make($request->all(), [
            'name'          => 'required|min:2|max:20|unique:categories',
            'description'   => 'required',
            'image'         => 'required',
        ])->validate();

        $new_category = new \App\Category;
        $new_category->name         = strtoupper($request->get('name'));
        $new_category->description  = $request->get('description');
        $new_category->create_by    = \Auth::user()->id;
        $new_category->slug         = \Str::slug($request->get('name'), '-');

        if ($request->file('image')) {
            // $image_path = $request->file('image')->store('category_image', 'public');
            $nama_file = time() . "_" . $request->file('image')->getClientOriginalName();
            $image_path = $request->file('image')->move('category_image', $nama_file);
            $new_category->image = $nama_file;
        }

        $new_category->save();

select * from `categories` where `categories`.`id` = '2' limit 1
---
    public function edit($id)
    {
        $category = \App\Category::findOrFail($id);

select * from `categories` where `categories`.`id` = '2' limit 1
---
    public function update(Request $request, $id)
    {
        $category = \App\Category::findOrFail($id);

select * from `categories` where `categories`.`id` = '2' limit 1
delete from `categories` where `id` = 1
---
    public function destroy($id)
    {
        $category = \App\Category::findOrFail($id);
        $category->articles()->sync([]);
        if ($category->image) {
            File::delete('category_image/' . $category->image);

update `categories` set `name` = 'NOODLESSSSS', `slug` = 'noodlesssss', `update_by` = 3, `categories`.`updated_at` = '2024-02-20 09:13:23' where `id` = 2
---
    public function restore($id)
    {
        $category = \App\Category::withTrashed()->findOrFail($id);
        $category->restore();

select * from `categories` where `name` Like '%%'
---
    public function ajaxSearch(Request $request)
    {
        $keyword = $request->get('q');
        $categories = \App\Category::where('name', 'Like', "%$keyword%")->get();